# Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
# Пример:
#       - A (3,6); B (2,1) -> 5,09
#       - A (7,-5); B (1,-1) -> 7,21

from this import s


x1 = int(input("Введите координату X точки A --> "))
y1 = int(input("Введите координату Y точки A --> "))
x2 = int(input("Введите координату X точки B --> "))
y2 = int(input("Введите координату Y точки B --> "))
s = (x2 - x1)*(x2 - x1) + (y2 - y1)*(y2 - y1)
sqrt = s ** (0.5)
print("Растояние между точкой А",(x1,y1)," и точкой B",(x2,y2), "равно ", round(sqrt, 2))